---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Stairs.ActualRisersNumber
zh: 楼梯
source: html/8a74a295-99ff-1a98-c0e5-cb84d86fed07.htm
---
# Autodesk.Revit.DB.Architecture.Stairs.ActualRisersNumber Property

**中文**: 楼梯

The total number of actually created risers in model.

## Syntax (C#)
```csharp
public int ActualRisersNumber { get; }
```

## Remarks
The number of steps needed to go through when moving from the base level to the top level of the stairs.